<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 9 changes.</summary>

```diff
# module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
! tailscale_tailnet_key.key must be replaced
- terraform_data.tailscale_node_deletion_hook[0] will be destroyed
# (because terraform_data.tailscale_node_deletion_hook is not in configuration)
! module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
! module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"] must be replaced
! module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] must be replaced
! module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] must be replaced
! module.proxmox_images.random_id.image_id["coreos_img"] must be replaced
! module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config must be replaced
+ module.ubuntu_dev_vm.proxmox_virtual_environment_vm.ubuntu_dev_vm will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 8 to add, 0 to change, 8 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-08T02:13:52Z [(view log)](https://github.com/perchnet/p/actions/runs/16820259141/job/47645609052#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm has changed
  ~ resource "proxmox_virtual_environment_vm" "coreos_vm" {
        id                      = "131"
      ~ ipv4_addresses          = [
            # (2 unchanged elements hidden)
            [],
          + [
              + "172.17.0.1",
            ],
        ]
      ~ ipv6_addresses          = [
            [
                "::1",
            ],
          - [
              - "2600:4808:6170:3a00::cc50",
              - "fdfd:3a:a7ff:0:3b32:80b0:4ffa:5c9b",
              - "2600:4808:6170:3a00:87d6:fe17:aa41:9cd7",
              - "fe80::7848:85f:53a9:a9ed",
            ],
          - [
              - "fe80::b9cc:b85e:1002:9b1",
            ],
          + [
              + "fdfd:3a:a7ff::9dc",
              + "fdfd:3a:a7ff:0:3b32:80b0:4ffa:5c9b",
              + "2600:4808:6170:3a00:87d6:fe17:aa41:9cd7",
              + "fe80::7848:85f:53a9:a9ed",
            ],
          + [
              + "fe80::dc41:aa93:6f9c:9741",
            ],
          + [],
        ]
      ~ mac_addresses           = [
            # (2 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "DE:E3:2B:2E:AB:D3",
        ]
        name                    = "tf-coreos-periphery-E1o"
      ~ network_interface_names = [
            # (2 unchanged elements hidden)
            "tailscale0",
          + "docker0",
        ]
        tags                    = [
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.key must be replaced
-/+ resource "tailscale_tailnet_key" "key" {
      ~ created_at    = "2025-08-08T01:31:28Z" -> (known after apply)
      ~ expires_at    = "2025-08-08T02:31:28Z" -> (known after apply)
      ~ id            = "kiXvigWvej11CNTRL" -> (known after apply)
      ~ invalid       = false -> (known after apply)
      ~ key           = (sensitive value)
      ~ reusable      = true -> false # forces replacement
        tags          = [
            "tag:komodo-periphery",
        ]
      + user_id       = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # terraform_data.tailscale_node_deletion_hook[0] will be destroyed
  # (because terraform_data.tailscale_node_deletion_hook is not in configuration)
  - resource "terraform_data" "tailscale_node_deletion_hook" {
      - id               = "aa300efb-c501-faee-8c42-30d09544594b" -> null
      - input            = (sensitive value) -> null
      - output           = [
          - "nhx2BCDuzD11CNTRL",
          - "tskey-api-kPQqditsTp11CNTRL-fN1DKd9mqxPBzbvGJKe24QAE9wLdX5zQH",
        ] -> null
      - triggers_replace = "120830cf" -> null
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "coreos_vm" {
      ~ id                      = "131" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.1.211",
            ],
          - [],
          - [
              - "172.17.0.1",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fdfd:3a:a7ff::9dc",
              - "fdfd:3a:a7ff:0:3b32:80b0:4ffa:5c9b",
              - "2600:4808:6170:3a00:87d6:fe17:aa41:9cd7",
              - "fe80::7848:85f:53a9:a9ed",
            ],
          - [
              - "fe80::dc41:aa93:6f9c:9741",
            ],
          - [],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "BC:24:11:00:DE:F2",
          - "00:00:00:00:00:00",
          - "DE:E3:2B:2E:AB:D3",
        ] -> (known after apply)
        name                    = "tf-coreos-periphery-E1o"
      ~ network_interface_names = [
          - "lo",
          - "ens18",
          - "tailscale0",
          - "docker0",
        ] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 131 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ file_format       = "raw" -> (known after apply)
          ~ file_id           = "zssd-files:iso/TFimg_fedora-coreos-42-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-131-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:00:DE:F2" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "images" {
      ~ checksum                = "2077469b9b9c8bf3c821b8c376e6df7fa2c9984fea4f2802f5c9bf079aae2cf5" -> "435fade994d94c47802bb4e02693c848818758745489c1715e4e5801f5aaa3a8" # forces replacement
      ~ file_name               = "TFimg_fedora-coreos-42-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply) # forces replacement
      ~ id                      = "zssd-files:iso/TFimg_fedora-coreos-42-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply)
      ~ size                    = 1986920448 -> (known after apply)
      ~ url                     = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250721.2.0/x86_64/fedora-coreos-42.20250721.2.0-proxmoxve.x86_64.qcow2.xz" -> "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250803.2.0/x86_64/fedora-coreos-42.20250803.2.0-proxmoxve.x86_64.qcow2.xz" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "images" {
      ~ file_name           = "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.iso" -> "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.img" # forces replacement
      ~ id                  = "zssd-files:iso/TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.iso" -> (known after apply)
      ~ size                = 677302272 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "images" {
      ~ file_name           = "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.iso" -> "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.img" # forces replacement
      ~ id                  = "zssd-files:iso/TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.iso" -> (known after apply)
      ~ size                = 613725184 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.proxmox_images.random_id.image_id["coreos_img"] must be replaced
-/+ resource "random_id" "image_id" {
      ~ b64_std     = "CZQ=" -> (known after apply)
      ~ b64_url     = "CZQ" -> (known after apply)
      ~ dec         = "2452" -> (known after apply)
      ~ hex         = "0994" -> (known after apply)
      ~ id          = "CZQ" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "url" = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250721.2.0/x86_64/fedora-coreos-42.20250721.2.0-proxmoxve.x86_64.qcow2.xz" -> "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250803.2.0/x86_64/fedora-coreos-42.20250803.2.0-proxmoxve.x86_64.qcow2.xz"
        }
        # (1 unchanged attribute hidden)
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_file.cloud_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "cloud_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "example.cloud-config.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/example.cloud-config.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

  # module.ubuntu_dev_vm.proxmox_virtual_environment_vm.ubuntu_dev_vm will be created
  + resource "proxmox_virtual_environment_vm" "ubuntu_dev_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "ubuntu-dev"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "ubuntu",
          + "tailscale",
          + "docker",
          + "dev",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = "raw"
          + import_from       = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "zssd-files"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEyhYKsPcfOeY139vtFE5E5KTsdtAboxZD8jRvy2VpBA",
                ]
              + password = (sensitive value)
              + username = "ubuntu"
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 4096
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + tpm_state {
          + datastore_id = "zssd"
          + version      = "v2.0"
        }

      + vga (known after apply)

      + virtiofs {
          + cache        = "always"
          + direct_io    = true
          + expose_acl   = false
          + expose_xattr = false
          + mapping      = "rust-root"
        }
    }

Plan: 8 to add, 0 to change, 8 to destroy.

Changes to Outputs:
  ~ images            = {
      ~ coreos_img               = {
          ~ checksum                = "2077469b9b9c8bf3c821b8c376e6df7fa2c9984fea4f2802f5c9bf079aae2cf5" -> "435fade994d94c47802bb4e02693c848818758745489c1715e4e5801f5aaa3a8"
          ~ file_name               = "TFimg_fedora-coreos-42-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply)
          ~ id                      = "zssd-files:iso/TFimg_fedora-coreos-42-0994.20250721.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply)
          ~ size                    = 1986920448 -> (known after apply)
          ~ url                     = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250721.2.0/x86_64/fedora-coreos-42.20250721.2.0-proxmoxve.x86_64.qcow2.xz" -> "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250803.2.0/x86_64/fedora-coreos-42.20250803.2.0-proxmoxve.x86_64.qcow2.xz"
            # (9 unchanged attributes hidden)
        }
      ~ ubuntu_jammy             = {
          ~ file_name               = "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.iso" -> "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.img"
          ~ id                      = "zssd-files:iso/TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.iso" -> (known after apply)
          ~ size                    = 677302272 -> (known after apply)
            # (11 unchanged attributes hidden)
        }
      ~ ubuntu_noble_cloud_image = {
          ~ file_name               = "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.iso" -> "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.img"
          ~ id                      = "zssd-files:iso/TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.iso" -> (known after apply)
          ~ size                    = 613725184 -> (known after apply)
            # (11 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }
  - tailscale_devices = [
      - {
          - addresses = [
              - "100.101.42.42",
              - "fd7a:115c:a1e0::8601:2a2a",
            ]
          - hostname  = "tf-coreos-periphery-E1o"
          - id        = "1664599652899330"
          - name      = "tf-coreos-periphery-e1o.shark-perch.ts.net"
          - node_id   = "nhx2BCDuzD11CNTRL"
          - tags      = [
              - "tag:periphery",
            ]
          - user      = ""
        },
    ] -> null
```
</details>
<!-- placeholder-5 -->
<!-- terraform-39-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->